       IDENTIFICATION    DIVISION.
       PROGRAM-ID.    EXERC7.
       AUTHOR.        YHAGO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    27/05/2025.
       DATE-COMPILED.
       SECURITY.    APENAS O AUTOR PODE MODIFICAR.

       ENVIRONMENT    DIVISION.
       CONFIGURATION    SECTION.
       SOURCE-COMPUTER.    MY-PC.
       OBJECT-COMPUTER.    MY-PC.
       SPECIAL-NAMES.    DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT     SECTION.
       FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK
                   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARQ-SORT ASSIGN TO DISK.
           SELECT RELALU ASSIGN TO DISK.

       DATA    DIVISION.
       FILE    SECTION.
       FD CADALU
           LABEL RECORD STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01 REG-ENTRADA.
           02 TURMA-ENT         PIC 9(03).
           02 CODALUNO-ENT      PIC 9(07).
           02 NOMEALUNO-ENT     PIC X(30).
           02 NOTAS-ENT.
             03 NOTA1          PIC 99V99.
             03 NOTA2          PIC 99V99.
             03 NOTA3          PIC 99V99.
             03 NOTA4          PIC 99V99.
       SD ARQ-SORT .
       01 REG-SORT.
           02 TURMA-SORT         PIC 9(03).
           02 CODALUNO-SORT      PIC 9(07).
           02 NOMEALUNO-SORT     PIC X(30).
           02 MEDIA-SORT         PIC 99V99.
       FD RELALU
           LABEL RECORD  OMITTED.
       01 REG-ATR      PIC X(80).
       WORKING-STORAGE SECTION.
           77 FIM-ARQ          PIC X(03) VALUE "NAO".
           77 CT-LIN           PIC 9(02) VALUE 40.
           77 CT-PAG           PIC 9(02) VALUE ZEROS.
           77 APROVADOS        PIC 9(03) VALUE ZEROS.
           77 REPROVADOS       PIC 9(03) VALUE ZEROS.
           77 MEDIA-GERAL      PIC 9(05)V9(02) VALUE ZEROS.
           77 TURMA            PIC 9(03) VALUE ZEROS.
       01 WHITE-CAB.
           02 FILLER     PIC X(80) VALUE SPACES.
       01 CAB-01.
           02 FILLER     PIC X(20) VALUE SPACES.
           02 FILLER     PIC X(17) VALUE "RELAÇÃO DE ALUNOS".
           02 FILLER     PIC X(15) VALUE SPACES.
           02 FILLER     PIC X(05) VALUE "PAG. ".
           02 VAR-PAG    PIC ZZ9.
       01 CAB-TURMA.
           02 FILLER     PIC X(07) VALUE "TURMA: ".
           02 VAR-TURMA  PIC 9(03).

       01 CAB-02.
           02 FILLER     PIC X(06) VALUE "CÓDIGO".
           02 FILLER     PIC X(15) VALUE SPACES.
           02 FILLER     PIC X(04) VALUE "NOME".
           02 FILLER     PIC X(15) VALUE SPACES.
           02 FILLER     PIC X(05) VALUE "MEDIA".
       01 DETALHE.
           02 VAR-COD       PIC 9(07).
           02 FILLER        PIC X(05) VALUE SPACES.
           02 VAR-NOME      PIC X(30) .
           02 FILLER        PIC X(10) VALUE SPACES.
           02 VAR-MEDIA     PIC Z9,99.

       01 RODAPE-APROVADOS.
           02 FILLER     PIC X(29)
               VALUE "TOTAL DE ALUNOS APROVADOS    ".
           02 ROD-APROVADOS  PIC Z9,99.
       01 RODAPE-REPROVADOS.
           02 FILLER     PIC X(29)
               VALUE "TOTAL DE ALUNOS REPROVADOS   ".
           02 ROD-REPROVADOS  PIC Z9,99.
       01 RODAPE-GERAL.
           02 FILLER     PIC X(29)
               VALUE "MEDIA GERAL                  ".
           02 ROD-MEDIA-GERAL  PIC Z9,99.
       PROCEDURE    DIVISION.
       PGM-EX05.
       SORT    ARQ-SORT
               ON ASCENDING KEY TURMA-SORT
               ON ASCENDING KEY CODALUNO-SORT
               INPUT PROCEDURE ROT-ENTRADA
               OUTPUT PROCEDURE ROT-RELATORIO.

       STOP    RUN.
       ROT-ENTRADA SECTION.
           PERFORM INICIO-ENTRADA.
           PERFORM PRINCIPAL-ENTRADA
                   UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM-ENTRADA.
       INICIO-ENTRADA SECTION.
           OPEN INPUT CADALU.
           PERFORM LEITURA-ENTRADA.
       LEITURA-ENTRADA SECTION.
              READ CADALU
                AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL-ENTRADA SECTION.
           PERFORM MEDIA-ENTRADA.
           PERFORM GRAVACAO-ENTRADA.
           PERFORM LEITURA-ENTRADA.

       MEDIA-ENTRADA SECTION.
        COMPUTE MEDIA-SORT = (NOTA1 + NOTA2 + NOTA3 + NOTA4) / 4.

       GRAVACAO-ENTRADA SECTION.
       DISPLAY "VALORES PARA SORT:" REG-SORT.
              MOVE TURMA-ENT TO TURMA-SORT.
              MOVE CODALUNO-ENT TO CODALUNO-SORT.
              MOVE NOMEALUNO-ENT TO NOMEALUNO-SORT.
                     DISPLAY "TURMA: " TURMA-SORT.
       DISPLAY "CODIGO: " CODALUNO-SORT.
       DISPLAY "NOME: " NOMEALUNO-SORT.
       DISPLAY "MEDIA: " MEDIA-SORT.
           RELEASE REG-SORT.

       FIM-ENTRADA.
           CLOSE CADALU.

       ROT-RELATORIO SECTION.
           PERFORM INICIO-SAIDA.
           PERFORM PRINCIPAL-SAIDA
                   UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM-SAIDA.

       INICIO-SAIDA SECTION.
           MOVE "NAO" TO FIM-ARQ.
           OPEN OUTPUT RELALU.
           PERFORM LEITURA-SAIDA.

       LEITURA-SAIDA SECTION.
           RETURN ARQ-SORT
            AT END
            PERFORM RODAPE
            MOVE 'SIM' TO FIM-ARQ.

       PRINCIPAL-SAIDA SECTION.
           PERFORM SELECAO-SAIDA.
           PERFORM LEITURA-SAIDA.
       SELECAO-SAIDA SECTION.
           IF MEDIA-SORT < 7
               ADD 1 TO REPROVADOS
           ELSE
               ADD 1 TO APROVADOS
           END-IF.
           PERFORM GRAVACAO-SAIDA.
       GRAVACAO-SAIDA SECTION.
           IF CT-LIN GREATER THAN 39
               PERFORM CABECALHO-01
           END-IF.
           IF NOT(TURMA-SORT = TURMA)
                PERFORM CABECALHO-02
           END-IF.
           MOVE TURMA-SORT TO TURMA.
           PERFORM DETALHES.
       CABECALHO-01   SECTION.
           ADD 1         TO CT-PAG.
           MOVE CT-PAG   TO VAR-PAG.
           MOVE SPACES   TO REG-ATR.
           WRITE REG-ATR AFTER ADVANCING PAGE.
           WRITE REG-ATR FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-ATR FROM WHITE-CAB AFTER ADVANCING 1 LINE.
           MOVE 2  TO CT-LIN.
       CABECALHO-02 SECTION.
           IF NOT(TURMA = ZEROS)
               MOVE TURMA-SORT TO VAR-TURMA
               MOVE APROVADOS TO ROD-APROVADOS
               MOVE REPROVADOS TO ROD-REPROVADOS
               COMPUTE
                  MEDIA-GERAL = MEDIA-GERAL / (APROVADOS + REPROVADOS)
               MOVE MEDIA-GERAL TO ROD-MEDIA-GERAL
               WRITE REG-ATR FROM RODAPE-APROVADOS
                   AFTER ADVANCING 2 LINE
               WRITE REG-ATR FROM RODAPE-REPROVADOS
                   AFTER ADVANCING 1 LINE
               WRITE REG-ATR FROM RODAPE-GERAL
                      AFTER ADVANCING 1 LINE
               MOVE ZEROS TO APROVADOS
               MOVE ZEROS TO REPROVADOS
               MOVE ZEROS TO MEDIA-GERAL
               PERFORM CABECALHO-01
               WRITE REG-ATR FROM CAB-TURMA
                   AFTER ADVANCING 1 LINE
           ELSE
                WRITE REG-ATR FROM CAB-TURMA
                   AFTER ADVANCING 1 LINE
           END-IF.

       DETALHES SECTION.
           ADD MEDIA-SORT TO MEDIA-GERAL.
           MOVE CODALUNO-SORT TO VAR-COD.
           MOVE NOMEALUNO-SORT TO VAR-NOME.
           MOVE MEDIA-SORT TO VAR-MEDIA.
           WRITE REG-ATR FROM DETALHE AFTER ADVANCING 1 LINE.
       RODAPE SECTION.
           MOVE APROVADOS TO RODAPE-APROVADOS.
           MOVE REPROVADOS TO ROD-REPROVADOS.
           MOVE MEDIA-GERAL TO ROD-MEDIA-GERAL.
           WRITE REG-ATR FROM RODAPE-APROVADOS AFTER ADVANCING 2 LINE.
           WRITE REG-ATR FROM RODAPE-REPROVADOS AFTER ADVANCING 1 LINE.
           WRITE REG-ATR FROM RODAPE-GERAL AFTER ADVANCING 1 LINE.

       FIM-SAIDA SECTION.
           CLOSE RELALU.
