       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX01.
       AUTHOR. Guilherme, Nirley, Renato.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 26/09/2023.
       DATE-COMPILED.
       SECURITY. NAO TEM.
      *REMARKS. LE UM REGISTRO E IMPRIME UM RELATORIO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. DELL.
       OBJECT-COMPUTER. DELL.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADSOC1 ASSIGN TO DISK 
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADSOC2 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELSOCIO ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       FD CADSOC1
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADSOC1.DAT".
       01 REG-CADSOC1.
           02 COD-PAG1 PIC 9(02).
               88 PAG-EM-DIA VALUE 01, 1.
               88 PAG-ATRASADO VALUE 02, 2.
           02 NUM-SOCIO1 PIC 9(06).
           02 NOME-SOCIO1 PIC X(30).
           02 VALOR-PAG1 PIC 9(09)V99.

       FD CADSOC2
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADSOC2.DAT".

       01 REG-CADSOC2.
           02 NUM-SOCIO2 PIC 9(06).
           02 NOME-SOCIO2 PIC X(30).
           02 VALOR-PAG2 PIC 9(09)V99.

       FD RELSOCIO
           LABEL RECORD IS OMITTED.
       01 REG-ATR PIC X(80).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 CT-LIN PIC 9(02) VALUE 30.
           77 CT-PAG PIC 9(02) VALUE ZEROES.
           77 CT-SOC-ATRAS PIC 9(05) VALUE ZEROES.
           77 VALOR-TOTAL-PGMTS PIC 9(11)V9(02) VALUE ZEROES.

           01 CAB-01.
               02 FILLER PIC X(70) VALUE SPACES.
               02 FILLER PIC X(05) VALUE "PAG.".
               02 VAR-PAG PIC 99.
               02 FILLER PIC X(03) VALUE SPACES.
           01 CAB-02.
               02 FILLER PIC X(26) VALUE SPACES.
               02 FILLER PIC X(27) VALUE "RELACAO DE SOCIOS ATRASADOS".
               02 FILLER PIC X(27) VALUE SPACES.
           01 CAB-03.
               02 FILLER PIC X(9) VALUE SPACES.
               02 FILLER PIC X(15) VALUE "NUMERO DO SOCIO".
               02 FILLER PIC X(08) VALUE SPACES.
               02 FILLER PIC X(13) VALUE "NOME DO SOCIO".
               02 FILLER PIC X(08) VALUE SPACES.
               02 FILLER PIC X(18) VALUE "VALOR DO PAGAMENTO".
               02 FILLER PIC X(09) VALUE SPACES.
           01 DETALHE.
               02 FILLER PIC X(08) VALUE SPACES.
               02 NUM PIC 9(06).
               02 FILLER PIC X(13) VALUE SPACES.
               02 NOME PIC X(30).
               02 FILLER PIC X(2) VALUE SPACES.
               02 VALOR PIC Z999.999.999,99.
               02 FILLER PIC X(16) VALUE SPACES.

       PROCEDURE DIVISION.

       REL-IMPRESSAO.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT CADSOC1
               OUTPUT CADSOC2
                      RELSOCIO.
           PERFORM LEITURA.

       LEITURA.
           READ CADSOC1
               AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA.

       GRAVAR-CADSOC2.
           MOVE NUM-SOCIO1 TO NUM-SOCIO2.
           MOVE NOME-SOCIO1 TO NOME-SOCIO2.
           MOVE VALOR-PAG1 TO VALOR-PAG2.
           WRITE REG-CADSOC2.

       IMPRESSAO.
           IF CT-LIN GREATER THAN 29
                  PERFORM CABECALHO
           END-IF.
           IF PAG-ATRASADO
               PERFORM IMPDET
               ADD 1 TO CT-SOC-ATRAS
               ADD VALOR-PAG1 TO VALOR-TOTAL-PGMTS
           ELSE
               PERFORM GRAVAR-CADSOC2
               ADD VALOR-PAG1 TO VALOR-TOTAL-PGMTS
           END-IF. 

       IMPDET.
           MOVE NUM-SOCIO1 TO NUM.
           MOVE NOME-SOCIO1 TO NOME.
           MOVE VALOR-PAG1 TO VALOR.   
           WRITE REG-ATR FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CT-LIN.

       CABECALHO.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REG-ATR.
           WRITE REG-ATR AFTER ADVANCING PAGE.
           WRITE REG-ATR FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-ATR FROM CAB-02 AFTER ADVANCING 2 LINES.
           WRITE REG-ATR FROM CAB-03 AFTER ADVANCING 2 LINES.
           MOVE ZEROES TO CT-LIN.

       FIM.
           CLOSE CADSOC1
                 CADSOC2
                 RELSOCIO.
