       IDENTIFICATION    DIVISION.
       PROGRAM-ID.    EXERC5.
       AUTHOR.        YHAGO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    24/05/2025.
       DATE-COMPILED.
       SECURITY.    APENAS O AUTOR PODE MODIFICAR.

       ENVIRONMENT    DIVISION.
       CONFIGURATION    SECTION.
       SOURCE-COMPUTER.    IBM-PC.
       OBJECT-COMPUTER.    IBM-PC.
       SPECIAL-NAMES.    DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT     SECTION.
       FILE-CONTROL.
           SELECT ARQVENDA ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARQ-SORT ASSIGN TO DISK.
           SELECT RELVENDA ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA    DIVISION.
       FILE    SECTION.
       FD ARQVENDA
           LABEL RECORD STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01 REG-CLIENTE.
           02 ESTADO-ENT        PIC X(02).
           02 NR-VENDEDOR-ENT   PIC 9(05).
           02 NOME-VENDEDOR-ENT PIC X(20).
           02 VALOR-VENDA-ENT   PIC 9(07)V99.
       SD ARQ-SORT.
       01 REG-SORT.
           02 ESTADO-SORT        PIC X(02).
           02 NR-VENDEDOR-SORT   PIC 9(05).
           02 NOME-VENDEDOR-SORT PIC X(20).
           02 VALOR-VENDA-SORT   PIC 9(07)V99.
       FD RELVENDA
           LABEL RECORD  OMITTED.
       01 REG-ATR      PIC X(80).
       WORKING-STORAGE SECTION.
           77 FIM-ARQ          PIC X(03) VALUE "NAO".
           77 CT-LIN           PIC 9(02) VALUE 20.
           77 CT-PAG           PIC 9(02) VALUE ZEROS.
           77 ESTADO           PIC X(02) VALUE ZEROS.
           77 NR-VENDEDOR      PIC 9(05) VALUE ZEROS.
           77 SOMA-VENDEDOR    PIC 9(10)V99 VALUE ZEROS.
           77 SOMA-ESTADO      PIC 9(10)V99 VALUE ZEROS.
           77 SOMA-COMPANHIA   PIC 9(10)V99 VALUE ZEROS.
       01 CAB.
           02 FILLER     PIC X(80) VALUE SPACES.
       01 CAB-01.
           02 FILLER     PIC X(20) VALUE SPACES.
           02 FILLER     PIC X(35)
               VALUE "VENDAS TOTAIS POR ESTADO - VENDEDOR".
           02 FILLER     PIC X(5) VALUE SPACES.
           02 FILLER     PIC X(05) VALUE "PAG. ".
           02 VAR-PAG    PIC ZZ9.
       01 CAB-ESTADO.
           02 FILLER     PIC X(08) VALUE "ESTADO: ".
           02 VAR-ESTADO PIC X(02).
       01 CAB-02.
           02 FILLER     PIC X(05) VALUE SPACES.
           02 FILLER     PIC X(15) VALUE "NRO DO VENDEDOR".
           02 FILLER     PIC X(10) VALUE SPACES.
           02 FILLER     PIC X(16) VALUE "NOME DO VENDEDOR".
           02 FILLER     PIC X(10) VALUE SPACES.
           02 FILLER     PIC X(14) VALUE "VALOR DA VENDA".
       01 DETALHE-01.
           02 FILLER      PIC X(10) VALUE SPACES.
           02 VAR-NUMERO    PIC ZZZZ9.
           02 FILLER      PIC X(15) VALUE SPACES.
           02 VAR-NOME    PIC X(20).
           02 FILLER     PIC X(10) VALUE SPACES.
           02 VAR-VALOR-01  PIC ZZZZZZ9,99.
       01 DETALHE-02.
           02 FILLER     PIC X(60) VALUE SPACES.
           02 VAR-VALOR-02  PIC ZZZZZZ9,99.
       01 RODAPE-VENDEDOR.
           02 FILLER     PIC X(39) VALUE SPACES.
           02 FILLER     PIC X(19) VALUE "TOTAL DO VENDEDOR: ".
           02 VAR-VALOR-VENDEDOR  PIC ZZZZZZZZ9,99.
       01 RODAPE-ESTADO.
           02 FILLER     PIC X(42) VALUE SPACES.
           02 FILLER     PIC X(17) VALUE "TOTAL DO ESTADO: ".
           02 VAR-VALOR-ESTADO  PIC ZZZZZZZZ9,99.
       01 RODAPE-COMPANHIA.
           02 FILLER     PIC X(40) VALUE SPACES.
           02 FILLER     PIC X(20) VALUE "TOTAL DA COMPANHIA: ".
           02 VAR-VALOR-COMPANHIA  PIC ZZZZZZZZ9,99.
       PROCEDURE    DIVISION.
       PGM-EX05.
       SORT    ARQ-SORT
               ON ASCENDING KEY ESTADO-SORT
               ON ASCENDING KEY NR-VENDEDOR-SORT
               USING ARQVENDA
               OUTPUT PROCEDURE ROT-RELATORIO.
       STOP    RUN.

       ROT-RELATORIO SECTION.
           PERFORM INICIO-SAIDA.
           PERFORM PRINCIPAL-SAIDA
                   UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM-SAIDA.

       INICIO-SAIDA SECTION.
           OPEN OUTPUT RELVENDA.
           PERFORM LEITURA-SAIDA.

       LEITURA-SAIDA SECTION.
           RETURN ARQ-SORT
            AT END
            PERFORM RODAPE
            MOVE 'SIM' TO FIM-ARQ.

       PRINCIPAL-SAIDA SECTION.
           PERFORM GRAVACAO-SAIDA.
           PERFORM LEITURA-SAIDA.

       GRAVACAO-SAIDA SECTION.
           IF CT-LIN GREATER THAN 19
               PERFORM CABECALHO-01
           END-IF.
           IF NOT(ESTADO-SORT = ESTADO)
                PERFORM CABECALHO-02
           END-IF.
           MOVE ESTADO-SORT TO ESTADO.
           PERFORM DETALHES.
       CABECALHO-01   SECTION.
           ADD 1         TO CT-PAG.
           MOVE CT-PAG   TO VAR-PAG.
           MOVE SPACES   TO REG-ATR.
           WRITE REG-ATR AFTER ADVANCING PAGE.
           WRITE REG-ATR FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-ATR FROM CAB AFTER ADVANCING 1 LINE.
           MOVE 1  TO CT-LIN.
       CABECALHO-02 SECTION.
           MOVE ESTADO-SORT TO VAR-ESTADO.
           MOVE SOMA-VENDEDOR TO VAR-VALOR-VENDEDOR.
           WRITE REG-ATR FROM RODAPE-VENDEDOR AFTER ADVANCING 2 LINE.
           MOVE ZEROS TO SOMA-VENDEDOR.
           IF NOT(SOMA-ESTADO = ZEROS)
               MOVE SOMA-ESTADO TO VAR-VALOR-ESTADO
               WRITE REG-ATR FROM RODAPE-ESTADO AFTER ADVANCING 2 LINE
               MOVE ZEROES TO SOMA-ESTADO
           END-IF.
           IF CT-LIN = 1
               WRITE REG-ATR FROM CAB-ESTADO AFTER ADVANCING 1 LINE
               ADD 3         TO CT-LIN
           ELSE
               WRITE REG-ATR FROM CAB-ESTADO AFTER ADVANCING 2 LINE
               ADD 4         TO CT-LIN
           END-IF.
           WRITE REG-ATR FROM CAB-02 AFTER ADVANCING 2 LINE.
       DETALHES SECTION.
           IF NOT(NR-VENDEDOR-SORT = NR-VENDEDOR)
               IF NOT(SOMA-VENDEDOR = ZEROS)
                   MOVE SOMA-VENDEDOR TO VAR-VALOR-VENDEDOR
                   WRITE REG-ATR
                   FROM RODAPE-VENDEDOR AFTER ADVANCING 2 LINE
               END-IF
               MOVE NR-VENDEDOR-SORT TO NR-VENDEDOR
               MOVE NR-VENDEDOR-SORT TO VAR-NUMERO
               MOVE NOME-VENDEDOR-SORT TO VAR-NOME
               MOVE VALOR-VENDA-SORT TO VAR-VALOR-01
               WRITE REG-ATR FROM DETALHE-01 AFTER ADVANCING 2 LINE
               MOVE VALOR-VENDA-SORT TO SOMA-VENDEDOR
               ADD VALOR-VENDA-SORT TO SOMA-ESTADO
               ADD VALOR-VENDA-SORT TO SOMA-COMPANHIA
               ADD 2        TO CT-LIN
           ELSE
               MOVE VALOR-VENDA-SORT TO VAR-VALOR-02
               WRITE REG-ATR FROM DETALHE-02 AFTER ADVANCING 1 LINE
               ADD VALOR-VENDA-SORT TO SOMA-VENDEDOR
               ADD VALOR-VENDA-SORT TO SOMA-ESTADO
               ADD VALOR-VENDA-SORT TO SOMA-COMPANHIA
               ADD 1         TO CT-LIN
           END-IF.

       RODAPE SECTION.
           MOVE SOMA-VENDEDOR TO VAR-VALOR-VENDEDOR.
           MOVE SOMA-ESTADO TO VAR-VALOR-ESTADO.
           MOVE SOMA-COMPANHIA TO VAR-VALOR-COMPANHIA.
           WRITE REG-ATR FROM RODAPE-VENDEDOR AFTER ADVANCING 2 LINE.
           WRITE REG-ATR FROM RODAPE-ESTADO AFTER ADVANCING 2 LINE.
           WRITE REG-ATR FROM RODAPE-COMPANHIA AFTER ADVANCING 2 LINE.

       FIM-SAIDA SECTION.
           CLOSE RELVENDA.
