       IDENTIFICATION    DIVISION.
       PROGRAM-ID.    EXERC3.
       AUTHOR.        YHAGO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    24/05/2025.
       DATE-COMPILED.
       SECURITY.    APENAS O AUTOR PODE MODIFICAR.
      *REMARKS    LER CADENT E GERAR CADSAI COM DEPS
      *         01 E 02, EM ORDEM CRESCENTE COD.

       ENVIRONMENT    DIVISION.
       CONFIGURATION    SECTION.
       SOURCE-COMPUTER.    IBM-PC.
       OBJECT-COMPUTER.    IBM-PC.
       SPECIAL-NAMES.    DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT     SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT TRABALHO ASSIGN TO DISK.
           SELECT SAIDA ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA    DIVISION.
       FILE    SECTION.
       FD ENTRADA
           LABEL RECORD STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01 REG-ENT.
           02 CODIGO-ENT    PIC 9(05).
           02 NOME-ENT    PIC X(30).
           02 DEPARTAMENTO-ENT    PIC 9(02).
       SD TRABALHO.
       01 REG-TRABALHO.
           02 CODIGO-TRAB    PIC 9(05).
           02 NOME-TRAB    PIC X(30).
       FD SAIDA
           LABEL RECORD  STANDARD
           VALUE OF FILE-ID IS "CADSAI.DAT".
       01 REG-SAI.
           03 CODIGO-SAI    PIC 9(05).
           03 NOME-SAI    PIC X(30).
       WORKING-STORAGE SECTION.
       77 FIM-ARQ    PIC X(03) VALUE "NAO".

       PROCEDURE    DIVISION.
       PGM-EX05.
       SORT    TRABALHO
               ASCENDING KEY CODIGO-TRAB
               INPUT PROCEDURE ROT-ENTRADA
               GIVING SAIDA.
       STOP    RUN.

       ROT-ENTRADA SECTION.
           PERFORM INICIO-ENTRADA.
           PERFORM PRINCIPAL-ENTRADA
                   UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM-ENTRADA.

       INICIO-ENTRADA SECTION.
           OPEN INPUT ENTRADA.
           PERFORM LEITURA-ENTRADA.

       LEITURA-ENTRADA SECTION.
           READ ENTRADA AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL-ENTRADA SECTION.
           PERFORM SELECAO-ENTRADA.
           PERFORM LEITURA-ENTRADA.

       SELECAO-ENTRADA SECTION.
           IF DEPARTAMENTO-ENT EQUAL "01" OR DEPARTAMENTO-ENT EQUAL "02"
                PERFORM GRAVACAO-ENTRADA.

       GRAVACAO-ENTRADA SECTION.
           MOVE CODIGO-ENT TO CODIGO-TRAB.
           MOVE NOME-ENT TO NOME-TRAB.
           RELEASE REG-TRABALHO.

       FIM-ENTRADA SECTION.
           CLOSE ENTRADA.
