       IDENTIFICATION DIVISION.
           PROGRAM-ID.    EXERC3.
           AUTHOR.        YHAGO.
           DATE-WRITTEN.  14/06/25.
           DATE-COMPILED.
           SECURITY.      SOMENTE O AUTOR PODE MODIFICALO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADMERC ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT MOVMERC ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELMERC ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ATUMERC  ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELERRO ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.

       FD CADMERC
           LABEL RECORD STANDARD
           VALUE OF FILE-ID IS "CADMERC.DAT".
       01 REG-CAD.
           02 CODMERC-CAD        PIC 9(03).
           02 DESC-CAD         PIC X(30).
           02 ESTOQMIN-CAD     PIC 9(03).
           02 QUANTESTOQ-CAD      PIC 9(03).
           02 UNITARIO-CAD     PIC 9(04)V99.
       FD MOVMERC
           LABEL RECORD STANDARD
           VALUE OF FILE-ID IS "MOVMERC.DAT".
       01 REG-MOV.
           02 CODMERC-MOV      PIC 9(03).
           02 DESC-MOV         PIC X(30).
           02 ESTOQMIN-MOV     PIC 9(03).
           02 QUANTESTOQ-MOV   PIC 9(03).
           02 UNITARIO-MOV     PIC 9(04)V99.
           02 TIPO-MOV         PIC X(01).
       FD ATUMERC
           LABEL RECORD  OMITTED.
       01 REG-ATU.
           02 CODMERC-ATU        PIC 9(03).
           02 DESC-ATU         PIC X(30).
           02 ESTOQMIN-ATU     PIC 9(03).
           02 QUANTESTOQ-ATU      PIC 9(03).
           02 UNITARIO-ATU     PIC 9(04)V99.
       FD RELERRO
           LABEL RECORD  OMITTED.
       01 REG-ERRO      PIC X(80).
       FD RELMERC
           LABEL RECORD  OMITTED.
       01 REG-MERC      PIC X(170).
       WORKING-STORAGE SECTION.
           77 CH-CADMERC PIC  X(04) VALUE SPACES.
           77 CH-MOVMERC PIC  X(04) VALUE SPACES.
           77 CH-TYPE   PIC  X(02) VALUE SPACES.
           77 CT-LIN-MERC           PIC 9(02) VALUE 40.
           77 CT-PAG-MERC           PIC 9(02) VALUE ZEROS.
           77 CT-LIN-ERRO           PIC 9(02) VALUE 40.
           77 CT-PAG-ERRO           PIC 9(02) VALUE ZEROS.
           77 VAR-COUNT             PIC 9(04) VALUE ZEROS.
       01 WHITE-CAB01.
           02 FILLER     PIC X(170) VALUE SPACES.
       01 WHITE-CAB02.
           02 FILLER     PIC X(80) VALUE SPACES.
       01 CAB01-MERC.
           02 FILLER     PIC X(34) VALUE SPACES.
           02 FILLER     PIC X(22) VALUE "RELAÇÃO DE MERCADORIAS".
           02 FILLER     PIC X(40) VALUE SPACES.
           02 FILLER     PIC X(05) VALUE "PAG. ".
           02 VAR-PAG-MERC    PIC ZZ9.
       01 CAB01-ERRO.
           02 FILLER     PIC X(20) VALUE SPACES.
           02 FILLER     PIC X(22) VALUE "RELAÇÃO DE MERCADORIAS".
           02 FILLER     PIC X(15) VALUE SPACES.
           02 FILLER     PIC X(05) VALUE "PAG. ".
           02 VAR-PAG-ERRO    PIC ZZ9.
       01 CAB02-ERRO.
           02 FILLER     PIC X(22) VALUE SPACES.
           02 FILLER     PIC X(20) VALUE "ERROS DE ATUALIZAÇÃO".

       01 CAB02-MERC.
           02 FILLER     PIC X(25) VALUE SPACES.
           02 FILLER     PIC X(15) VALUE "ESTOQUE CRÍTICO".

       01 CAB03-ERRO.
           02 FILLER     PIC X(06) VALUE "CODIGO".
           02 FILLER     PIC X(05) VALUE SPACES.
           02 FILLER     PIC X(09) VALUE "DESCRIÇÀO".
           02 FILLER     PIC X(24) VALUE SPACES.
           02 FILLER     PIC X(08) VALUE "MENSAGEM".
       01 CAB03-MERC.
           02 FILLER     PIC X(06) VALUE "CODIGO".
           02 FILLER     PIC X(05) VALUE SPACES.
           02 FILLER     PIC X(09) VALUE "DESCRIÇÀO".
           02 FILLER     PIC X(27) VALUE SPACES.
           02 FILLER     PIC X(14) VALUE "ESTOQUE MÍNIMO".
           02 FILLER     PIC X(05) VALUE SPACES.
           02 FILLER     PIC X(18) VALUE "QUANTIDADE ESTOQUE".
           02 FILLER     PIC X(05) VALUE SPACES.
           02 FILLER     PIC X(14) VALUE "PREÇO UNITARIO".

       01 DETALHE-MERC.
           02 FILLER        PIC X(01) VALUE SPACES.
           02 VAR-COD-MERC       PIC ZZ9.
           02 FILLER        PIC X(07) VALUE SPACES.
           02 VAR-DESCR     PIC X(30) .
           02 FILLER        PIC X(04) VALUE SPACES.
           02 VAR-ESTOQMIN  PIC ZZ9.
           02 FILLER        PIC X(16) VALUE SPACES.
           02 VAR-ESTOQQUAN  PIC ZZ9.
           02 FILLER        PIC X(18) VALUE SPACES.
           02 VAR-UNITARIO  PIC Z.ZZ9,99.
       01 DETALHE-ERRO.
           02 FILLER          PIC X(01) VALUE SPACES.
           02 VAR-COD-ERRO    PIC ZZ9.
           02 FILLER          PIC X(5) VALUE SPACES.
           02 VAR-DESCR-ERRO  PIC X(30) .
           02 FILLER          PIC X(5) VALUE SPACES.
           02 VAR-MSG-ERRO        PIC X(35).

       PROCEDURE DIVISION.
       PGM-04.
       PERFORM INICIO.
       PERFORM PRINCIPAL
           UNTIL CH-CADMERC EQUAL CH-MOVMERC AND
           CH-MOVMERC EQUAL   HIGH-VALUES.
       PERFORM FIM.
       STOP RUN.
       INICIO.
           OPEN INPUT CADMERC
                      MOVMERC
                OUTPUT ATUMERC RELERRO RELMERC.
           PERFORM LER-CADMERC.
           PERFORM LER-MOVMERC.

       LER-CADMERC.
           READ CADMERC AT END MOVE HIGH-VALUE TO CH-CADMERC.
           IF  NOT(CH-CADMERC EQUAL HIGH-VALUE)
               MOVE CODMERC-CAD TO CH-CADMERC
           END-IF.
       LER-MOVMERC.
           READ MOVMERC AT END MOVE HIGH-VALUE TO CH-MOVMERC.
           IF  NOT(CH-MOVMERC EQUAL HIGH-VALUE)
               MOVE CODMERC-MOV TO CH-MOVMERC
           END-IF.
       PRINCIPAL.
           IF TIPO-MOV EQUAL "I" OR TIPO-MOV EQUAL "E" OR TIPO-MOV
                                                          EQUAL "A"
               IF CH-CADMERC EQUAL CH-MOVMERC
                   PERFORM IGUAL
                   PERFORM LER-CADMERC
                   PERFORM LER-MOVMERC
               ELSE IF CH-CADMERC LESS CH-MOVMERC
                   PERFORM CADMERC-MENOR
                   PERFORM LER-CADMERC
               ELSE IF CH-MOVMERC LESS CH-CADMERC
                   PERFORM MOVMERC-MENOR
                   PERFORM LER-MOVMERC
               END-IF
           ELSE
               PERFORM LER-MOVMERC
           END-IF.

       IGUAL.
           IF TIPO-MOV EQUAL "I"
               MOVE "EI" TO CH-TYPE
               PERFORM GRAVACAO-REL-ERRO
               PERFORM GRAVACAO-SAIDA-2
           ELSE IF TIPO-MOV EQUAL "A"
               IF QUANTESTOQ-MOV LESS ESTOQMIN-MOV OR QUANTESTOQ-MOV
                             EQUAL ESTOQMIN-MOV
                   PERFORM GRAVACAO-REL-MERC
                   END-IF
               MOVE "EA" TO CH-TYPE
               PERFORM GRAVACAO-SAIDA-1
           ELSE IF TIPO-MOV EQUAL "E"
               MOVE "EE" TO CH-TYPE
           END-IF.
       MOVMERC-MENOR.
           IF TIPO-MOV EQUAL "I"
               IF QUANTESTOQ-MOV LESS ESTOQMIN-MOV OR QUANTESTOQ-MOV
                               EQUAL ESTOQMIN-MOV
                   PERFORM GRAVACAO-REL-MERC
                   END-IF
               PERFORM GRAVACAO-SAIDA-1
           ELSE IF TIPO-MOV EQUAL "A"
               MOVE "MA" TO CH-TYPE
               PERFORM GRAVACAO-REL-ERRO
           ELSE IF TIPO-MOV EQUAL "E"
               MOVE "ME" TO CH-TYPE
               PERFORM GRAVACAO-REL-ERRO
           END-IF.
       CADMERC-MENOR.
           PERFORM GRAVACAO-SAIDA-2.
       GRAVACAO-SAIDA-1.
           WRITE REG-ATU FROM REG-MOV.
       GRAVACAO-SAIDA-2.
           WRITE REG-ATU FROM REG-CAD.
       GRAVACAO-REL-MERC.
           IF CT-LIN-MERC GREATER THAN 39
               PERFORM CABECALHO-MERC
           END-IF.
           PERFORM DETALHES-MERC.
       GRAVACAO-REL-ERRO.
           IF CT-LIN-ERRO GREATER THAN 39
               PERFORM CABECALHO-ERRO
           END-IF.
           PERFORM DETALHES-ERRO.
       DETALHES-ERRO.
           MOVE CODMERC-MOV TO VAR-COD-ERRO
           MOVE DESC-MOV TO VAR-DESCR-ERRO
           IF CH-TYPE EQUAL "EI"
               MOVE "INCLUSÃO P/REG. JÁ EXISTENTE" TO VAR-MSG-ERRO
           ELSE IF CH-TYPE EQUAL "MA"
               MOVE "ALTERAÇÃO P/REG. INEXISTENTE" TO VAR-MSG-ERRO
           ELSE IF CH-TYPE EQUAL "ME"
               MOVE "EXCLUSÃO P/REG. INEXISTENTE" TO VAR-MSG-ERRO
           END-IF.
           WRITE REG-ERRO FROM DETALHE-ERRO AFTER ADVANCING 1 LINE
           ADD 1 TO CT-LIN-ERRO.
       DETALHES-MERC.
           MOVE CODMERC-MOV TO VAR-COD-MERC.
           MOVE DESC-MOV TO VAR-DESCR.
           MOVE ESTOQMIN-MOV TO VAR-ESTOQMIN.
           MOVE QUANTESTOQ-MOV TO VAR-ESTOQQUAN.
           MOVE UNITARIO-MOV TO VAR-UNITARIO
           WRITE REG-MERC FROM DETALHE-MERC AFTER ADVANCING 1 LINE
           ADD 1 TO CT-LIN-MERC.

       CABECALHO-MERC.
           ADD 1         TO CT-PAG-MERC.
           MOVE CT-PAG-MERC   TO VAR-PAG-MERC.
           MOVE SPACES   TO REG-MERC.
           WRITE REG-MERC AFTER ADVANCING PAGE.
           WRITE REG-MERC FROM CAB01-MERC AFTER ADVANCING 1 LINE.
           WRITE REG-MERC FROM WHITE-CAB01 AFTER ADVANCING 1 LINE.
           WRITE REG-MERC FROM CAB02-MERC AFTER ADVANCING 1 LINE.
           WRITE REG-MERC FROM CAB03-MERC AFTER ADVANCING 1 LINE.
           WRITE REG-MERC FROM WHITE-CAB01 AFTER ADVANCING 1 LINE.
           MOVE 6  TO CT-LIN-MERC.
       CABECALHO-ERRO.
           ADD 1         TO CT-PAG-ERRO.
           MOVE CT-PAG-ERRO   TO VAR-PAG-ERRO.
           MOVE SPACES   TO REG-ERRO.
           WRITE REG-ERRO AFTER ADVANCING PAGE.
           WRITE REG-ERRO FROM CAB01-ERRO AFTER ADVANCING 1 LINE.
           WRITE REG-ERRO FROM WHITE-CAB02 AFTER ADVANCING 1 LINE.
           WRITE REG-ERRO FROM CAB02-ERRO AFTER ADVANCING 1 LINE.
           WRITE REG-ERRO FROM CAB03-ERRO AFTER ADVANCING 1 LINE.
           WRITE REG-ERRO FROM WHITE-CAB02 AFTER ADVANCING 1 LINE.
           MOVE 6  TO CT-LIN-ERRO.

       FIM.
            CLOSE CADMERC MOVMERC RELMERC ATUMERC RELERRO.
