-- ----------------------------------------------------------------------------------------
-- Gabriel Issa Shammas (GIS) - 01 de janeiro de 2000 a 31 de dezembro de 2020
-- ----------------------------------------------------------------------------------------
-- INS00071- GIS_TB07S001_CIDADES
--
-- Inserir todos os dados nesta tabela.
-- Após a inserção, exibir os dados da tabela.
--
-- ----------------------------------------------------------------------------------------
-- Atenção. Indicação do BD a ser usado. Se for o caso, mude o nome do Banco.
-- ----------------------------------------------------------------------------------------
--
USE BDGIS;
--
-- ----------------------------------------------------------------------------------------
-- Limpeza prévia da tabela. Excluindo todos os dados.
-- ----------------------------------------------------------------------------------------
--
Delete From dbo.GIS_TB07S001_CIDADES
  Where cod_pais = 071;
--
-- ----------------------------------------------------------------------------------------
-- Inserção dos dados.
-- ----------------------------------------------------------------------------------------
--
-- ----------------------------------------------------------------------------------------
-- 071 (Espanha) --------------------------------------------------------------------------
-- ----------------------------------------------------------------------------------------
--
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Barcelona', NULL, NULL, NULL);
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Madri', NULL, NULL, NULL);
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Sevilha', NULL, NULL, NULL);
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Valência', NULL, NULL, NULL);
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Zaragoza', NULL, NULL, NULL);
--
Insert into dbo.GIS_TB07S001_CIDADES values
  (71, '  ', 'Nihil', NULL, NULL, NULL);
--
-- ----------------------------------------------------------------------------------------
-- Seleção de todos os dados para visualização do conteúdo da tabela.
-- ----------------------------------------------------------------------------------------
--
Select *
 From dbo.GIS_TB07S001_CIDADES;
--
-- ----------------------------------------------------------------------------------------
-- Fim TB07S001 INS00071
-- ----------------------------------------------------------------------------------------
--
--
