-- ----------------------------------------------------------------------------------------
-- Gabriel Issa Shammas (GIS) - 01 de janeiro de 2000 a 31 de dezembro de 2020
-- ----------------------------------------------------------------------------------------
-- INS00206- GIS_TB08S009_CIDADE_IDH
--
-- Inserir todos os dados nesta tabela.
-- Após a inserção, exibir os dados da tabela.
--
-- ----------------------------------------------------------------------------------------
-- Atenção. Indicação do BD a ser usado. Se for o caso, mude o nome do Banco.
-- ----------------------------------------------------------------------------------------
--
USE BDGIS;
--
-- ----------------------------------------------------------------------------------------
-- Limpeza prévia da tabela. Excluindo todos os dados.
-- ----------------------------------------------------------------------------------------
--
Delete From dbo.GIS_TB08S009_CIDADE_IDH
  Where cod_pais = 206;
--
-- ----------------------------------------------------------------------------------------
-- Inserção dos dados.
-- ----------------------------------------------------------------------------------------
--
-- ----------------------------------------------------------------------------------------
-- 206 (Suécia) ---------------------------------------------------------------------------
-- ----------------------------------------------------------------------------------------
--
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Estocolmo', NULL, NULL, NULL);
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Gotemburgo', NULL, NULL, NULL);
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Linköping', NULL, NULL, NULL);
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Olofström', NULL, NULL, NULL);
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Södertälje', NULL, NULL, NULL);
--
Insert into dbo.GIS_TB08S009_CIDADE_IDH values
  (206, '  ', 'Nihil', NULL, NULL, NULL);
--
-- ----------------------------------------------------------------------------------------
-- Seleção de todos os dados para visualização do conteúdo da tabela.
-- ----------------------------------------------------------------------------------------
--
Select *
 From dbo.GIS_TB08S009_CIDADE_IDH;
--
-- ----------------------------------------------------------------------------------------
-- Fim TB07S001 INS00206
-- ----------------------------------------------------------------------------------------
--
--
