-- ----------------------------------------------------------------------------------------
-- Gabriel Issa Shammas (GIS) - 01 de janeiro de 2000 a 31 de dezembro de 2020
-- ----------------------------------------------------------------------------------------
-- INS00004- GIS_TB01S005_CONTINENTE
--
-- Efetue a eliminação do registro de código 8 desta tabela.
-- Após a eliminação do registro, reinsira o registro de código conforme descrito abaixo.
--   (8, 'Fantasia', 'FAN', NULL, NULL, getdate());
-- Após a inserção do registro, exibir os dados da tabela.
--
-- ----------------------------------------------------------------------------------------
-- Atenção. Indicação do BD a ser usado. Se for o caso, mude o nome do Banco.
-- ----------------------------------------------------------------------------------------
--
USE BDGIS;
--
-- ----------------------------------------------------------------------------------------
-- Eliminação dos dados.
-- ----------------------------------------------------------------------------------------
--
Delete from dbo.GIS_TB01S005_CONTINENTE
 Where codigo = 8;
--
-- ----------------------------------------------------------------------------------------
-- Inserção dos dados
-- ----------------------------------------------------------------------------------------
--
Insert into dbo.GIS_TB01S005_CONTINENTE values
 (8, 'Fantasia', 'FAN', NULL, NULL, getdate());
--
-- ----------------------------------------------------------------------------------------
-- Seleção de todos os dados para visualização do conteúdo da tabela.
-- ----------------------------------------------------------------------------------------
--
Select *
  From dbo.GIS_TB01S005_CONTINENTE;
--
-- ----------------------------------------------------------------------------------------
-- Comentários.
-- ----------------------------------------------------------------------------------------
--
-- Agora, o registro de código 8 está inserido de modo correto.
-- Criamos um novo continente, denominado FANTASIA (Fantasy).
--
-- ----------------------------------------------------------------------------------------
-- Fim TB01S005 INS00004
-- ----------------------------------------------------------------------------------------
--
--
